# 변수타입
# 변수: 값을 저장하는 공간(그릇) / alt+방향표 이동가능
# 숫자형타입(정수형, 실수형), 문자열타입, 불타입(bool)
# int, float,str,bool
# 정수형 -1,2,3 소수점 없음
# 실수형 - 1.1,2.2 소수점이 있음
# 문자열 - "안녕", '111'
# 불타입 - True, False 대문자만 가능. true, false 소문자 안됨.

# 타입확인하는 방법 type(변수) - int, float, str,bool

# 변수규칙
# 특수문자 사용 불가능 
# _만 가능...
a=10
_a=10
a_1=10
# 다만 숫자가 제일 앞에 오는 것은 안됨
# 예로 1_a=10  #에러남. 숫자가 제일 끝에 오든지 중간에 여러개 있는건 가능.
a_1_2_b=10
A_111_22=10 # 대문자도 사용 가능.

# 예약어 사용은 불가능
# 예로 Ture=1 #bool 타입에 없는 값은 사용할 수 없음.
# if for 와 같은 명령어로 사용하는 것은 사용할 수 없음.


