




# # a,b를 입력받아
# # 합계가 100 넘으면 100보다 큰수, 100작으면 100보다 작은수라고 출력하시오.

# # 1. 숫자입력
# a = int(input("숫자를 입력하시오."))
# b = int(input("숫자를 입력하시오."))
# # 합계
# c = a+b
# # 3. 조건
# if c>100:
#     print("100보다 큰수")
# else:
#     print("100보다 작은수")

# print("입력숫자:{},{}/ 합계:{}".format(a,b,c))
# print("입력한 숫자: {},{}".format(a,b))
# print("입력한 숫자:",a,b)





# # print("10"==10) #문자 10과 숫자 10은 다름
# a = int(input("숫자입력 : ")) # 문자타입->숫자타입
# if a>100:
#     print("100보다 큰수")
#     #print("입력한 숫자:",a) #위에 것과 같이 들여쓰기 간격이 같아야함.
# else:
#     print("100보다 작은수")

# print("입력한 숫자:",a) # 공통부분이 있으면 바깥쪽으로 빼서 정리, 반복되면 시간더 걸림.




# a =101
# if a<100:
#    print("100보다 작은 수 입니다.") #if문 다음에는 띄어쓰기를 해야 인식
# else:
#    print("100보다 큰 수 입니다.") #if문이 거짓이면 else값이 출력.
# print("종료")